In [ ]:
#Introduction/Our Understanding: 
#A Capstone project containing 3 dataframes which includes specific attributes such as ID of project head, name, gender, designation, cost, status of project etc.
#Status of project determines promotion or demotion of designation level, with 1 being the highest, 2 & 3 - Mid position and 4 being lowest designtion level.
#Below set of coding provides analysis on the dataframes using python

In [6]:
import pandas as pd   #importing pandas

In [7]:
import numpy as np   #importing numpy

In [8]:
#Task 1 : Convert provided three different tables into three dataframe in python and save them as three .csv files. 
#Adding "Project DataFrame" data to create Dataframes using dictionary format
#Here, 'ID', 'Project', 'Cost', 'Status' are keys of the dictionary which turns into columns in the dataframe and each list inside the dictionary becomes that column's values
project_data = [
    {"ID": "A001", "Project": "Project 1", "Cost": 1002000, "Status": "Finished"},   
    {"ID": "A002", "Project": "Project 2", "Cost": 2000000, "Status": "Ongoing"},
    {"ID": "A003", "Project": "Project 3", "Cost": 4500000, "Status": "Finished"},
    {"ID": "A004", "Project": "Project 4", "Cost": 5500000, "Status": "Ongoing"},
    {"ID": "A005", "Project": "Project 5", "Cost": np.nan, "Status": "Finished"},
    {"ID": "A002", "Project": "Project 6", "Cost": 680000, "Status": "Failed"},
    {"ID": "A005", "Project": "Project 7", "Cost": 400000, "Status": "Finished"},
    {"ID": "A003", "Project": "Project 8", "Cost": 350000, "Status": "Failed"},
    {"ID": "A001", "Project": "Project 9", "Cost":  np.nan, "Status": "Ongoing"},
    {"ID": "A003", "Project": "Project 10", "Cost": 300000, "Status": "Finished"},
    {"ID": "A001", "Project": "Project 11", "Cost": 2000000, "Status": "Failed"},
    {"ID": "A004", "Project": "Project 12", "Cost": 1000000, "Status": "Ongoing"},
    {"ID": "A004", "Project": "Project 13", "Cost": 3000000, "Status": "Finished"},
    {"ID": "A005", "Project": "Project 14", "Cost": 200000, "Status": "Finished"}
]

In [9]:
#Adding "Employee DataFrame" data to create Dataframes
#Here, 'ID', 'Name', 'Gender', 'City' and 'Age' are keys of the dictionary which turns into columns in the dataframe and each list inside the dictionary becomes that column's values
employee_data = [
    {"ID": "A001", "Name": "John Alter", "Gender": "M", "City": "Paris", "Age": 25},
    {"ID": "A002", "Name": "Alice Luxumberg", "Gender": "F", "City": "London", "Age": 27},
    {"ID": "A003", "Name": "Tom Sabestine", "Gender": "M", "City": "Berlin", "Age": 29},
    {"ID": "A004", "Name": "Nina Adgra", "Gender": "F", "City": "Newyork", "Age": 31},
    {"ID": "A005", "Name": "Amy Johny", "Gender": "F", "City": "Madrid", "Age": 30}
]

In [10]:
#Adding "Seniority Level DataFrame" data to create Dataframes
#Here, 'ID' and 'Designation Level' are keys of the dictionary which turns into columns in the dataframe and each list inside the dictionary becomes that column's values
seniority_data = [
    {"ID": "A001", "Designation Level": 2},
    {"ID": "A002", "Designation Level": 2},
    {"ID": "A003", "Designation Level": 3},
    {"ID": "A004", "Designation Level": 2},
    {"ID": "A005", "Designation Level": 3}
]

In [11]:
#Creating Dataframes
#Now the dictionaries are converted to Dataframes to give the dictionary a Table structure
project_df = pd.DataFrame(project_data)
employee_df = pd.DataFrame(employee_data)
seniority_df = pd.DataFrame(seniority_data)

In [12]:
#Saving created dataframes to .csv files
#The data is now converted to '.csv' files to refer them for further tasks
project_df.to_csv('project_dataframe.csv', index=False)
employee_df.to_csv('employee_dataframe.csv', index=False)
seniority_df.to_csv('seniority_dataframe.csv', index=False)

In [13]:
#Task 2 : Fill in the missing values in Cost column by running average using “For” loop for this task.
df = pd.read_csv('project_dataframe.csv')    # This code will read the 'project_dataframe.csv' file and enables us to access the data

In [14]:
df['Cost'] = pd.to_numeric(df['Cost'], errors='coerce')    # While building dataframe although they are mapped using np.nan for missing values, it could not read the value. Hence the parameter errors='coerce' converts these values to NaN (Not a Number) which is a special marker for missing values.

In [15]:
running_sum = 0               # Initialising data for "for" loop  
count = 0                     # Initialising data for "for" loop 
costs = df['Cost'].tolist()   # The code converts the 'Cost' column in the DataFrame to a Python list for easier iteration
for i in range(len(costs)):   # Range starts from '0' to '13' which is the total lenght of the dataframe
    if pd.isna(costs[i]):     # pd.isna() check if the value is NaN or not for each i
        if count > 0:         #if count > 0 then it enters if statement, if not it enters else statement
            costs[i] = running_sum / count    # Computing average
        else:
            costs[i] = 0  # or another logic if all previous values are missing
    else:
        running_sum += costs[i]    # Stepping to next iteration
        count += 1                 # Stepping to next iteration
df['Cost'] = costs                 # Assigning costs to df(Cost)
df['Cost'] = df['Cost'].round(2)   # Rounding of the decimal place to 2

In [16]:
df.to_csv('project_dataframe_updated.csv', index=False)   # Saving updated dataframe

In [17]:
print(df)

      ID     Project        Cost    Status
0   A001   Project 1  1002000.00  Finished
1   A002   Project 2  2000000.00   Ongoing
2   A003   Project 3  4500000.00  Finished
3   A004   Project 4  5500000.00   Ongoing
4   A005   Project 5  3250500.00  Finished
5   A002   Project 6   680000.00    Failed
6   A005   Project 7   400000.00  Finished
7   A003   Project 8   350000.00    Failed
8   A001   Project 9  2061714.29   Ongoing
9   A003  Project 10   300000.00  Finished
10  A001  Project 11  2000000.00    Failed
11  A004  Project 12  1000000.00   Ongoing
12  A004  Project 13  3000000.00  Finished
13  A005  Project 14   200000.00  Finished

In [19]:
#Task 3 : Split the name column in the Employee dataframe into two new columns “First Name”,and “LastName” and remove the older “Name” column.
import pandas as pd     #importing pandas
import numpy as np      #importing numpy

In [47]:
edf = pd.read_csv('employee_dataframe.csv')      # This code will read the 'employee_dataframe.csv' file and enables us to access the data

In [48]:
edf[['First Name', 'Last Name']] = edf['Name'].str.split(' ', n=1, expand=True)    # Wherever there is a ' ' (Blank space) in the Name column, split() function will split the column into 2 columns

In [49]:
del edf['Name']     # Deleting the Name column

In [50]:
new_order = ['ID', 'First Name', 'Last Name', 'Gender', 'City', 'Age' ]
edf = edf[new_order]      # In order to arrange the columns as per desire, this code is used

In [51]:
print(edf)

     ID First Name  Last Name Gender     City  Age
0  A001       John      Alter      M    Paris   25
1  A002      Alice  Luxumberg      F   London   27
2  A003        Tom  Sabestine      M   Berlin   29
3  A004       Nina      Adgra      F  Newyork   31
4  A005        Amy      Johny      F   Madrid   30

In [52]:
edf.to_csv('employee_dataframe_updated.csv', index=False)      # Saving the updated file

In [4]:
#Task 4 : Join all three dataframes in one single dataframe with the name “Final”
# Reading all the dataframes to perform the required task
df = pd.read_csv('project_dataframe_updated.csv')
edf = pd.read_csv('employee_dataframe_updated.csv')
sdf = pd.read_csv('seniority_dataframe.csv')

In [5]:
df_edf_merged = pd.merge(df, edf, on='ID', how='left')     # joining two dataframes with a primary key 'ID'

In [6]:
Final = pd.merge(df_edf_merged,sdf, on='ID', how='left')   # joining the merged dataframes with sdf dataframe through a primary key 'ID'

In [7]:
Final.to_csv('Final.csv', index=False)                     # saving the merged dataframe as 'Final.csv' file

In [8]:
#Task 5 : Give a 5% bonus (new column) concerning project cost only to employees who have finished the projects.
# Creating new column called bonus and giving 5% bonus to employees with finished project status
Final['Bonus'] = Final.apply(lambda row: row['Cost'] * 0.05 if row['Status'] == 'Finished' else 0, axis=1)

In [9]:
print(Final[['ID', 'Project', 'Cost', 'Status', 'Bonus']])  # printing only the required columns

      ID     Project        Cost    Status     Bonus
0   A001   Project 1  1002000.00  Finished   50100.0
1   A002   Project 2  2000000.00   Ongoing       0.0
2   A003   Project 3  4500000.00  Finished  225000.0
3   A004   Project 4  5500000.00   Ongoing       0.0
4   A005   Project 5  3250500.00  Finished  162525.0
5   A002   Project 6   680000.00    Failed       0.0
6   A005   Project 7   400000.00  Finished   20000.0
7   A003   Project 8   350000.00    Failed       0.0
8   A001   Project 9  2061714.29   Ongoing       0.0
9   A003  Project 10   300000.00  Finished   15000.0
10  A001  Project 11  2000000.00    Failed       0.0
11  A004  Project 12  1000000.00   Ongoing       0.0
12  A004  Project 13  3000000.00  Finished  150000.0
13  A005  Project 14   200000.00  Finished   10000.0

In [1]:
import pandas as pd   #importing pandas
import numpy as np    #importing numpy

In [11]:
#Task 6 : Demote the designation level by 1, whose projects have status “fail” and Delete the employees record whose designation level is above 4
Final.loc[Final['Status'].str.lower() == 'failed', 'Designation Level'] += 1

In [12]:
Final = Final[Final['Designation Level'] <= 4]    #removing rows where 'Designation Level' is greater than 4

In [13]:
print(Final)     # printing required output

      ID     Project        Cost    Status First Name  Last Name Gender  \
0   A001   Project 1  1002000.00  Finished       John      Alter      M
1   A002   Project 2  2000000.00   Ongoing      Alice  Luxumberg      F
2   A003   Project 3  4500000.00  Finished        Tom  Sabestine      M
3   A004   Project 4  5500000.00   Ongoing       Nina      Adgra      F
4   A005   Project 5  3250500.00  Finished        Amy      Johny      F
5   A002   Project 6   680000.00    Failed      Alice  Luxumberg      F
6   A005   Project 7   400000.00  Finished        Amy      Johny      F
7   A003   Project 8   350000.00    Failed        Tom  Sabestine      M
8   A001   Project 9  2061714.29   Ongoing       John      Alter      M
9   A003  Project 10   300000.00  Finished        Tom  Sabestine      M
10  A001  Project 11  2000000.00    Failed       John      Alter      M
11  A004  Project 12  1000000.00   Ongoing       Nina      Adgra      F
12  A004  Project 13  3000000.00  Finished       Nina      Adgra      F
13  A005  Project 14   200000.00  Finished        Amy      Johny      F

       City  Age  Designation Level     Bonus
0     Paris   25                  2   50100.0
1    London   27                  2       0.0
2    Berlin   29                  3  225000.0
3   Newyork   31                  2       0.0
4    Madrid   30                  3  162525.0
5    London   27                  3       0.0
6    Madrid   30                  3   20000.0
7    Berlin   29                  4       0.0
8     Paris   25                  2       0.0
9    Berlin   29                  3   15000.0
10    Paris   25                  3       0.0
11  Newyork   31                  2       0.0
12  Newyork   31                  2  150000.0
13   Madrid   30                  3   10000.0

In [20]:
Final.to_csv('Final.csv', index=False)      # saving the updated file as 'Final.csv'

In [2]:
df = pd.read_csv('Final.csv')  # This code will read the file 'Final.csv' to variable 'df' and enables us to access the data

In [22]:
print(Final)    # printing the dataframe for reading the data

      ID     Project        Cost    Status First Name  Last Name Gender  \
0   A001   Project 1  1002000.00  Finished       John      Alter      M
1   A002   Project 2  2000000.00   Ongoing      Alice  Luxumberg      F
2   A003   Project 3  4500000.00  Finished        Tom  Sabestine      M
3   A004   Project 4  5500000.00   Ongoing       Nina      Adgra      F
4   A005   Project 5  3250500.00  Finished        Amy      Johny      F
5   A002   Project 6   680000.00    Failed      Alice  Luxumberg      F
6   A005   Project 7   400000.00  Finished        Amy      Johny      F
7   A003   Project 8   350000.00    Failed        Tom  Sabestine      M
8   A001   Project 9  2061714.29   Ongoing       John      Alter      M
9   A003  Project 10   300000.00  Finished        Tom  Sabestine      M
10  A001  Project 11  2000000.00    Failed       John      Alter      M
11  A004  Project 12  1000000.00   Ongoing       Nina      Adgra      F
12  A004  Project 13  3000000.00  Finished       Nina      Adgra      F
13  A005  Project 14   200000.00  Finished        Amy      Johny      F

       City  Age  Designation Level     Bonus
0     Paris   25                  2   50100.0
1    London   27                  2       0.0
2    Berlin   29                  3  225000.0
3   Newyork   31                  2       0.0
4    Madrid   30                  3  162525.0
5    London   27                  3       0.0
6    Madrid   30                  3   20000.0
7    Berlin   29                  4       0.0
8     Paris   25                  2       0.0
9    Berlin   29                  3   15000.0
10    Paris   25                  3       0.0
11  Newyork   31                  2       0.0
12  Newyork   31                  2  150000.0
13   Madrid   30                  3   10000.0

In [23]:
# 'First name' column from 'df' is selected on LHS and on RHS, a conditional statement 'IF' is used to check the Gender. 
# If the Gender is 'M' then 'Mr' is printed before first name else 'MRS' is printed.
df['First Name'] = df.apply(lambda row: 'Mr. ' + row['First Name'] if row['Gender'] == 'M' else 'Mrs. ' + row['First Name'], axis=1)

In [24]:
print(df)    # Checking for the prefix

      ID     Project        Cost    Status  First Name  Last Name Gender  \
0   A001   Project 1  1002000.00  Finished    Mr. John      Alter      M
1   A002   Project 2  2000000.00   Ongoing  Mrs. Alice  Luxumberg      F
2   A003   Project 3  4500000.00  Finished     Mr. Tom  Sabestine      M
3   A004   Project 4  5500000.00   Ongoing   Mrs. Nina      Adgra      F
4   A005   Project 5  3250500.00  Finished    Mrs. Amy      Johny      F
5   A002   Project 6   680000.00    Failed  Mrs. Alice  Luxumberg      F
6   A005   Project 7   400000.00  Finished    Mrs. Amy      Johny      F
7   A003   Project 8   350000.00    Failed     Mr. Tom  Sabestine      M
8   A001   Project 9  2061714.29   Ongoing    Mr. John      Alter      M
9   A003  Project 10   300000.00  Finished     Mr. Tom  Sabestine      M
10  A001  Project 11  2000000.00    Failed    Mr. John      Alter      M
11  A004  Project 12  1000000.00   Ongoing   Mrs. Nina      Adgra      F
12  A004  Project 13  3000000.00  Finished   Mrs. Nina      Adgra      F
13  A005  Project 14   200000.00  Finished    Mrs. Amy      Johny      F

       City  Age  Designation Level     Bonus
0     Paris   25                  2   50100.0
1    London   27                  2       0.0
2    Berlin   29                  3  225000.0
3   Newyork   31                  2       0.0
4    Madrid   30                  3  162525.0
5    London   27                  3       0.0
6    Madrid   30                  3   20000.0
7    Berlin   29                  4       0.0
8     Paris   25                  2       0.0
9    Berlin   29                  3   15000.0
10    Paris   25                  3       0.0
11  Newyork   31                  2       0.0
12  Newyork   31                  2  150000.0
13   Madrid   30                  3   10000.0

In [16]:
df = df.drop(columns=['Gender'])   # Dropping the Gender column as per requirement

In [17]:
print(df)   # Printing the final output

      ID     Project        Cost    Status First Name  Last Name     City  \
0   A001   Project 1  1002000.00  Finished       John      Alter    Paris
1   A002   Project 2  2000000.00   Ongoing      Alice  Luxumberg   London
2   A003   Project 3  4500000.00  Finished        Tom  Sabestine   Berlin
3   A004   Project 4  5500000.00   Ongoing       Nina      Adgra  Newyork
4   A005   Project 5  3250500.00  Finished        Amy      Johny   Madrid
5   A002   Project 6   680000.00    Failed      Alice  Luxumberg   London
6   A005   Project 7   400000.00  Finished        Amy      Johny   Madrid
7   A003   Project 8   350000.00    Failed        Tom  Sabestine   Berlin
8   A001   Project 9  2061714.29   Ongoing       John      Alter    Paris
9   A003  Project 10   300000.00  Finished        Tom  Sabestine   Berlin
10  A001  Project 11  2000000.00    Failed       John      Alter    Paris
11  A004  Project 12  1000000.00   Ongoing       Nina      Adgra  Newyork
12  A004  Project 13  3000000.00  Finished       Nina      Adgra  Newyork
13  A005  Project 14   200000.00  Finished        Amy      Johny   Madrid

    Age  Designation Level     Bonus
0    25                  2   50100.0
1    27                  2       0.0
2    29                  3  225000.0
3    31                  1       0.0
4    30                  2  162525.0
5    27                  3       0.0
6    30                  2   20000.0
7    29                  4       0.0
8    25                  2       0.0
9    29                  3   15000.0
10   25                  3       0.0
11   31                  1       0.0
12   31                  1  150000.0
13   30                  2   10000.0

In [3]:
#Task 8 : Promote designation level by 1 for the employees whose age is more than 29 years using IF condition.
count = 0                          # Starting the iteration count from '0'
for i in range(len(df)):           # Range is considered from length of the dataframe (0-13)
    if df.loc[i, 'Age'] > 29:      # checking for 'Age > 29'. If the condition is 'True' then it moves to the next statement.
        df.loc[i, 'Designation Level'] -= 1     # Here, the designation level is promoted by 1 level. 
    else:                          # if the 'IF' statement returns 'False', then else statement is executed.
        count += 1                 # And iteration count is incremented by 1

In [4]:
print(df)          # Printing the output

      ID     Project        Cost    Status First Name  Last Name Gender  \
0   A001   Project 1  1002000.00  Finished       John      Alter      M
1   A002   Project 2  2000000.00   Ongoing      Alice  Luxumberg      F
2   A003   Project 3  4500000.00  Finished        Tom  Sabestine      M
3   A004   Project 4  5500000.00   Ongoing       Nina      Adgra      F
4   A005   Project 5  3250500.00  Finished        Amy      Johny      F
5   A002   Project 6   680000.00    Failed      Alice  Luxumberg      F
6   A005   Project 7   400000.00  Finished        Amy      Johny      F
7   A003   Project 8   350000.00    Failed        Tom  Sabestine      M
8   A001   Project 9  2061714.29   Ongoing       John      Alter      M
9   A003  Project 10   300000.00  Finished        Tom  Sabestine      M
10  A001  Project 11  2000000.00    Failed       John      Alter      M
11  A004  Project 12  1000000.00   Ongoing       Nina      Adgra      F
12  A004  Project 13  3000000.00  Finished       Nina      Adgra      F
13  A005  Project 14   200000.00  Finished        Amy      Johny      F

       City  Age  Designation Level     Bonus
0     Paris   25                  2   50100.0
1    London   27                  2       0.0
2    Berlin   29                  3  225000.0
3   Newyork   31                  1       0.0
4    Madrid   30                  2  162525.0
5    London   27                  3       0.0
6    Madrid   30                  2   20000.0
7    Berlin   29                  4       0.0
8     Paris   25                  2       0.0
9    Berlin   29                  3   15000.0
10    Paris   25                  3       0.0
11  Newyork   31                  1       0.0
12  Newyork   31                  1  150000.0
13   Madrid   30                  2   10000.0

In [5]:
#Task 9 : Add the cost of all projects for each Employee and save it in new dataframe “TotalProjCost” with three columns ID, First Name, and Total cost
total_cost_by_id = df.groupby('ID')['Cost'].sum().reset_index()    # Grouping each employee and adding up the cost of every project of respective employee ID and saving the output in 'total_cost_by_id' variable.

In [6]:
print(total_cost_by_id)   # checking for errors if any

     ID        Cost
0  A001  5063714.29
1  A002  2680000.00
2  A003  5150000.00
3  A004  9500000.00
4  A005  3850500.00

In [7]:
total_proj_cost = pd.merge(total_cost_by_id, df, on='ID', how='left')    # Merging/ joining the 'total_cost_by_id' column with 'df'

In [8]:
print(total_proj_cost)    # Printing the merged/ joined dataframe

      ID      Cost_x     Project      Cost_y    Status First Name  Last Name  \
0   A001  5063714.29   Project 1  1002000.00  Finished       John      Alter
1   A001  5063714.29   Project 9  2061714.29   Ongoing       John      Alter
2   A001  5063714.29  Project 11  2000000.00    Failed       John      Alter
3   A002  2680000.00   Project 2  2000000.00   Ongoing      Alice  Luxumberg
4   A002  2680000.00   Project 6   680000.00    Failed      Alice  Luxumberg
5   A003  5150000.00   Project 3  4500000.00  Finished        Tom  Sabestine
6   A003  5150000.00   Project 8   350000.00    Failed        Tom  Sabestine
7   A003  5150000.00  Project 10   300000.00  Finished        Tom  Sabestine
8   A004  9500000.00   Project 4  5500000.00   Ongoing       Nina      Adgra
9   A004  9500000.00  Project 12  1000000.00   Ongoing       Nina      Adgra
10  A004  9500000.00  Project 13  3000000.00  Finished       Nina      Adgra
11  A005  3850500.00   Project 5  3250500.00  Finished        Amy      Johny
12  A005  3850500.00   Project 7   400000.00  Finished        Amy      Johny
13  A005  3850500.00  Project 14   200000.00  Finished        Amy      Johny

   Gender     City  Age  Designation Level     Bonus
0       M    Paris   25                  2   50100.0
1       M    Paris   25                  2       0.0
2       M    Paris   25                  3       0.0
3       F   London   27                  2       0.0
4       F   London   27                  3       0.0
5       M   Berlin   29                  3  225000.0
6       M   Berlin   29                  4       0.0
7       M   Berlin   29                  3   15000.0
8       F  Newyork   31                  1       0.0
9       F  Newyork   31                  1       0.0
10      F  Newyork   31                  1  150000.0
11      F   Madrid   30                  2  162525.0
12      F   Madrid   30                  2   20000.0
13      F   Madrid   30                  2   10000.0

In [9]:
total_proj_cost = total_proj_cost[['ID', 'First Name', 'Cost_x']]  # Printing only the required columns

In [10]:
print(total_proj_cost.head())    # checking the first five rows for any errors

     ID First Name      Cost_x
0  A001       John  5063714.29
1  A001       John  5063714.29
2  A001       John  5063714.29
3  A002      Alice  2680000.00
4  A002      Alice  2680000.00

In [11]:
total_proj_cost = total_proj_cost.rename(columns={'Cost_x': 'Total cost'})   # changing the name of the column to 'Total Cost'

In [12]:
print(total_proj_cost)    # printing the final output

      ID First Name  Total cost
0   A001       John  5063714.29
1   A001       John  5063714.29
2   A001       John  5063714.29
3   A002      Alice  2680000.00
4   A002      Alice  2680000.00
5   A003        Tom  5150000.00
6   A003        Tom  5150000.00
7   A003        Tom  5150000.00
8   A004       Nina  9500000.00
9   A004       Nina  9500000.00
10  A004       Nina  9500000.00
11  A005        Amy  3850500.00
12  A005        Amy  3850500.00
13  A005        Amy  3850500.00

In [13]:
#Task 10 : Print all the employee details whose city name contains the letter “o” in it.
# This code will read the file 'employee_dataframe_updated.csv' to variable 'edf' and enables us to access the data
edf = pd.read_csv('employee_dataframe_updated.csv')

In [14]:
print(edf)    # Printing the dataframe to see the data

     ID First Name  Last Name Gender     City  Age
0  A001       John      Alter      M    Paris   25
1  A002      Alice  Luxumberg      F   London   27
2  A003        Tom  Sabestine      M   Berlin   29
3  A004       Nina      Adgra      F  Newyork   31
4  A005        Amy      Johny      F   Madrid   30

In [15]:
employees_with_o = edf[edf['City'].str.contains('o', case=False, na=False)]    # Checking for the employees whose city names contain 'o'

print(employees_with_o)    # Printing the Final output

     ID First Name  Last Name Gender     City  Age
1  A002      Alice  Luxumberg      F   London   27
3  A004       Nina      Adgra      F  Newyork   31